#+STARTUP: latexpreview

* Example
#+HEADERS: :includes <math.h> :flags -lm 
#+HEADERS: :var x=2.0 :var y=5.0 :var z=10.0
#+BEGIN_SRC C 
  double pi = 4*atan(1);
  double r, theta, phi;
  r = sqrt(x*x+y*y+z*z);
  theta = acos(z/r);
  phi = atan2(y,x);
  printf("%f %f %f", r, theta, phi);
#+END_SRC

#+RESULTS:
: 11.357817 0.493984 1.190290
